//Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
//0, 7, 8, -2, -2 -> 2
//1, -7, 567, 89, 223-> 4
//Console.Write("Введите элементы(через пробел): ");
//int[] arr = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
//int count = 0;

//for (int i = 0; i < arr.Length; i++)
//{
//    if (arr[i] > 0)
//    {
//        count++;
//    }
//}

//Console.WriteLine($"Кол-во элементов > 0: {count}");

//Решение задачи№41 без использования массива
//void PositiveNumbers()
//{
//    Console.Write("Количество чисел: ");
//    int size = Convert.ToInt32(Console.ReadLine());
//    int count = 0;
//    for (int i = 0; i < size; i++)
//    {
//        Console.Write($"Введите число номер {i + 1} - ");
//        int num = Convert.ToInt32(Console.ReadLine());
//        if (num > 0)
//            count++;
//    }
//    Console.WriteLine($"Вы ввели {count} положительных числа");
//}
//PositiveNumbers();

//Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.
//b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)
// Решение задачи не найдено, чужой код использовать не буду так как нет понимания его работы.
